app/views/articles/index.html.erb

            <div class="article-meta-details">
                <small>created by: <%= article.user.email.split('@').first%>,
                    <%= time_ago_in_words(article.created_at) %> ago, last updated:
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]