app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "sdvzxcvzxc"], ["description", "vzxcvzxcvzcvzcvzxc"], ["created_at", "2019-07-19 11:44:58.023521"], ["updated_at", "2019-07-19 11:44:58.023521"], ["user_id", 1]]
---
    def create
        @article = Article.new(article_params)
        @article.user = User.find(current_user.id)
        if @article.save

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "fadsfasdfasdsss"], ["updated_at", "2019-07-19 09:54:56.028963"], ["id", 3]]
---
    def update
        if @article.update(article_params)